FILES/Catalogs/ДополнительныйФункционал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ДополнительныйФункционал</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОтладки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлуОтладки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючМодуля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонОписания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПубличнаяКомпонента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСкриптаШины</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриватныйСкрипт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкриптШины</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДопФункционала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДополнительногоФункционала</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальнаяВерсияСистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяВерсияСистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешКомпоненты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьОтправкуДанныхОбОшибкахРазработчикам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенДляВыгрузкиВШину</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключитьАвтоматическоеОбновление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаТранзакцию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиСервера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокОбрабатываемыхСобытий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКОбъектуМетаданных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбрабатываемоеСобытие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительноеДействие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзображенияОписания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СсылкаНаИзображениеВШине</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазваниеИзображения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изображение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FILES/Catalogs/ДополнительныйФункционал/Forms/Форма/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Процедура УстановитьМодульНаСервере(КлючМодуля)
	МаркетПлейсВызовСервера.УстановитьМодульМаркетплейса(КлючМодуля);
КонецПроцедуры



&НаКлиенте
Процедура ПослеЗакрытияВопросаСкрипта(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.ОК Тогда
		УстановитьМодульНаСервере(Параметры);
    КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьМодуль(Команда)
	
	Если ЭтаФорма.Элементы.СписокМодулей.ТекущиеДанные <> Неопределено Тогда
		ТД = ЭтаФорма.Элементы.СписокМодулей.ТекущиеДанные;
		
		Если ТД.Стоимость > 0 И ТД.Оплачено = Ложь Тогда 
			Режим = РежимДиалогаВопрос.ОКОтмена;
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаСкрипта", ЭтаФорма, ТД.КлючМодуля);
			ПоказатьВопрос(Оповещение, "Данная компонента платная, при установке данной компоненты будет списана сумма с баланса компании в размере "+ТД.Стоимость+" рублей"+Символы.ПС+"Вы уверенны, что хотите установить компоненту?", Режим, 0, КодВозвратаДиалога.Отмена, "Установка платной компоненты");
		Иначе
			УстановитьМодульНаСервере(ТД.КлючМодуля);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриОткрытииНаСервере()
	БалансКомпании = МаркетПлейсВызовСервера.ПолучитьБалансКомпании();
	ТДанных = МаркетПлейсВызовСервера.ПолучимМодулиМаркетплейса();
	СписокМодулей.Загрузить(ТДанных);
	
	Результат = МаркетПлейсВызовСервера.СтатусБДВМаркетПлейсВШине();
	ЭтаФорма.Элементы.ФормаДобавитьБазуВМаретПлейс.Видимость   = НЕ Результат;
	ЭтаФорма.Элементы.ФормаУдалитьБазуИзМаркетплейса.Видимость = Результат;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	ПриОткрытииНаСервере();
КонецПроцедуры




&НаСервере
Процедура ДобавитьБазуВМаретПлейсНаСервере()
	Результат = МаркетПлейсВызовСервера.УстановитьБДВМаркетПлейсВШине();
	Если НЕ Результат.Результат Тогда
		
		ВхОбъект = Результат.ВхОбъект;
		ЧтениеJSON = Новый ЧтениеJSON; 
		ЧтениеJSON.УстановитьСтроку(ВхОбъект);
		СтруктураЖСОН = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		Сообщить(СтруктураЖСОН.error);
	Иначе
		ЭтаФорма.Элементы.ФормаДобавитьБазуВМаретПлейс.Видимость   = Ложь;
		ЭтаФорма.Элементы.ФормаУдалитьБазуИзМаркетплейса.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьБазуВМаретПлейс(Команда)
	ДобавитьБазуВМаретПлейсНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьБазуИзМаркетплейсаНаСервере()
	Результат = МаркетПлейсВызовСервера.УдалитьБДВМаркетПлейсВШине();
	Если НЕ Результат.Результат Тогда
		
		ВхОбъект = Результат.ВхОбъект;
		ЧтениеJSON = Новый ЧтениеJSON; 
		ЧтениеJSON.УстановитьСтроку(ВхОбъект);
		СтруктураЖСОН = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		Сообщить(СтруктураЖСОН.error);
	Иначе
		ЭтаФорма.Элементы.ФормаДобавитьБазуВМаретПлейс.Видимость   = Истина;
		ЭтаФорма.Элементы.ФормаУдалитьБазуИзМаркетплейса.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьБазуИзМаркетплейса(Команда)
	УдалитьБазуИзМаркетплейсаНаСервере();
КонецПроцедуры





&НаСервере
Функция СписокМодулейВыборНаСервере(ИдентификаторМодуля)
	Описание = МаркетПлейсВызовСервера.ПолучимОписаниеМодуляМаркетплейса(ИдентификаторМодуля);
	Возврат Описание;
КонецФункции

&НаКлиенте
Процедура СписокМодулейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
КонецПроцедуры

&НаКлиенте
Процедура СписокМодулейПриАктивизацииСтроки(Элемент)
	Если Элементы.СписокМодулей.ТекущиеДанные <> Неопределено Тогда
		Если Элементы.СписокМодулей.ТекущиеДанные.Описание = "" Тогда
			Описание = СписокМодулейВыборНаСервере(Элементы.СписокМодулей.ТекущиеДанные.КлючМодуля);
			Элементы.СписокМодулей.ТекущиеДанные.Описание = Описание;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры



&НаСервере
Процедура ОбновитьКомпонентыНаСервере()
	МаркетПлейсВызовСервера.ОбновитьКомпонентыМаркетПлейс();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКомпоненты(Команда)
	ОбновитьКомпонентыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура БалансКомпанииНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.ДополнительныйФункционал.Форма.ФормаОтчета");
КонецПроцедуры
